#Μετά απο κάθε πραγματοποίηση κάποιας επιλογής απο το μενού(1-4) υπάρχει ξαναεμφάνιση της επιλογής τραπεζιού(0-10).
#Δηλαδή αν επιλέξω το τραπέζι 1 και την επιλογή 1 ( Έναρξη Παραγγελίας) , 
#μετά αν θέλω να κάνω κάποια άλλη ενέργεια σε αυτό το τραπέζι πρέπει να το ξαναεπιλέξω πρώτα.
#Αυτό το έκανα καθώς να μπορούμε να διαχειριζόμαστε πολλές παραγγελίες ταυτόχρονα σε πολλά τραπέζια.

#Λίστα που περιέχει το menu του προγράμματος
menu = [
    ("Chicken Burger", "Burger με κοτόπουλο, bacon, τυρί edam, τομάτα, μαρούλι με μαγιονέζα", 4.20),
    ("Ham Burger", "Burger με μπιφτέκι, τυρί, κέτσαπ, μουστάρδα", 2.85),
    ("Green Burger", "Burger με ζουμερό μπιφτέκι, τυρί, φρέσκια τομάτα, μαρούλι, κρεμμύδι, πίκλες, κέτσαπ και dressing sauce", 4.20),
    ("Club Sandwich", "Club sandwich με 3 πλούσιες στρώσεις Philadelphia σε φρυγανισμένο ψωμί του τοστ με ζουμερό κοτόπουλο φιλέρο, bacon, τομάτα, μαρούλι και τηγανητές πατάτες", 10.90),
    ("Σαλάτα ceasar’s", "Δροσερή πράσινη σαλάτα με ζουμερό κοτόπουλου σε βάση μαρουλιού, με καλαμπόκι, κρουτόν, τριμμένο τυρί και vinaigratte ελαιόλαδου", 6.90),
    ("Κινόα με Λαχανικά", "Δροσερή σαλάτα με κινόα, κόκκινη πιπεριά, τοματίνια, αγγούρι, δυόσμο, φρέσκο μαϊντανό και sauce λαδολέμονο.", 6.30)
]
#Δισδιάστατη λίστα, η οποία καθορίζει τις παραγγελίες κάθε τραπεζιού.
order = [[],
         [],
         [],
         [],
         [],
         [],
         [],
         [],
         [],
         [],
         []]
while True:
    #Επαναληπτική δομή μέχρι να εισαχθεί μια έγκυρη τιμή για το τραπέζι (0-10).
    #Στη συνέχεια, εμφανίζονται οι επιλογές του προγράμματος και ζητείται από τον χρήστη να επιλέξει μία επιλογή.
    while True:
        try:
            table = int(input("Διάλεξε τραπέζι (0-10): "))
            if table < 0 or table > 10:
                print("Εισάγετε έναν έγκυρο αριθμό(0-10).")
            else:
                break
        except ValueError:
            print("Εισάγετε έναν έγκυρο αριθμό(0-10).")
    print("Επιλέχθηκε το τραπέζι:", table)
    #Εμφάνιση επιλογών προγράμματος.
    print("\nΕπιλογές:")
    print("==========")
    print("1. Έναρξη Παραγγελίας")
    print("2. Εμφάνιση Παραγγελίας")
    print("3. Αφαίρεση προϊόντος από την παραγγελία")
    print("4. Πληρωμή")
    choice = input("Εισάγετε την επιλογή: ")
    #Αν ο χρήστης επιλέξει "1", το πρόγραμμα εμφανίζει μια λίστα με τα προϊόντα. 
    #Στη συνέχεια, ζητάει από το χρήστη να εισαγάγει τον αριθμό του προϊόντος που θέλει να παραγγείλει και την ποσότητα που επιθυμεί. 
    #Αν ο χρήστης δώσει έγκυρες τιμές, το προϊόν και η ποσότητα προστίθενται στη λίστα της παραγγελίας. 
    #Aν γίνει λάθος επιλογή τιμής ποσότητας ο χρήστης καλλείται να ξαναδώσει και το προϊόν και την ποσότητα.
    #Μετά από κάθε προσθήκη προϊόντος, ο χρήστης ερωτάται αν θέλει να προσθέσει κι άλλο προϊόν ή να σταματήσει (y/n). 
    #Αν ο χρήστης επιλέξει να προσθέσει άλλο προϊόν, η διαδικασία επαναλαμβάνεται. 
    #Αν ο χρήστης επιλέξει να σταματήσει, επιστρέφει στο μενού.
    if choice == "1":
        print("\nΕπιλογές:")
        print("==========")
        for i, item in enumerate(menu):
            print(f"{i}. {item[0]} - {item[1]} - {item[2]}€")
        while True:
            try:
                item_choice = int(input("\nΕισάγετε τον αριθμό προϊόντος από το μενού: "))
                if 0 <= item_choice < len(menu):
                    quantity = int(input("Εισάγετε την ποσότητα: "))
                    if quantity > 0:
                        order[table].append((item_choice, quantity))
                        print(f"\nΤο προϊόν '{menu[item_choice][0]}' με ποσότητα {quantity} προστέθηκε στην παραγγελία.\n")
                        add_another = input("Θέλετε να προσθέσετε κι άλλο προϊόν; (y/n): ")
                        while add_another.lower() not in ["y", "n"]:
                            print("Εισάγετε 'y' ή 'n'")
                            add_another = input("Θέλετε να προσθέσετε κι άλλο προϊόν; (y/n): ")
                        if add_another.lower() == "n":
                            break
                    else:
                        print("Εισάγετε έναν έγκυρο αριθμό προϊόντος και ποσότητας.")
                else:
                    print("Εισάγετε έναν έγκυρο αριθμό προϊόντος και ποσότητας.")
            except ValueError:
                print("Εισάγετε έναν έγκυρο αριθμό προϊόντος και ποσότητας.")
    #Αν ο χρήστης επιλέξει "2", το πρόγραμμα εμφανίζει την παραγγελία του τραπεζιού που έχει επιλεχθεί. 
    #Αν η παραγγελία του χρήστη δεν είναι άδεια , τότε εμφανίζεται στο χρήστη η παραγγελία του και το συνολικό κόστος της.
    #Αν η παραγγελία είναι άδεια, τότε εμφανίζεται το αντίστοιχο μήνυμα.           
    elif choice == "2":
        if order[table]:
            print("\nΗ παραγγελία σας:")
            print("===================")
            totablel = 0
            for item in order[table]:
                item_choice, quantity = item
                item_totablel = menu[item_choice][2] * quantity
                totablel += item_totablel
                print(f"{quantity} x {menu[item_choice][0]} - {menu[item_choice][2]}€ - Σύνολο: {item_totablel:.2f}€")
            print(f"\nΣυνολικά: {totablel:.2f}€")
        else:
            print("\nΗ παραγγελία σας είναι άδεια.")
    #Αν ο χρήστης επιλέξει "3", δίνεται η δυνατότητα στον χρήστη να αφαιρέσει κάποιο προϊόν από την παραγγελία του τραπεζιού που έχει επιλεχθεί.
    #Αν η παραγγελία δεν είναι άδεια, τότε εμφανίζεται στο χρήστη η λίστα των προϊόντων στην παραγγελία με τις αντίστοιχες ποσότητες και τις τιμές τους. 
    #Στη συνέχεια ζητείται από τον χρήστη να εισάγει τον αριθμό προϊόντος που θέλει να αφαιρέσει. 
    #Αν ο χρήστης δώσει έναν έγκυρο αριθμό προϊόντος, τότε του ζητείται  χρήστη να επιβεβαιώσει την αφαίρεση (y/n) του συγκεκριμένου προϊόντος.
    #Αν ο χρήστης επιλέξει "y" η αφαίρεση του προϊόντος πραγματοποιείται κανονικά, ενώ αν "n" αναιρείται.
    #Αν η παραγγελία είναι άδεια, τότε εμφανίζεται στο χρήστη το αντίστοιχο μήνυμα.       
    elif choice == "3":
        if order[table]:
            print("\nΠαραγγελία:")
            print("===========")
            for i, item in enumerate(order[table]):
                print(f"{i}. {menu[item[0]][0]} x {item[1]} - {menu[item[0]][2]:.2f}€")
            while True:
                try:
                    item_choice = int(input("\nΕισάγετε τον αριθμό προϊόντος που θέλετε να αφαιρέσετε από την παραγγελία: "))
                    if 0 <= item_choice < len(order[table]):
                        confirm = ""
                        while confirm.lower() != "y" and confirm.lower() != "n":
                            confirm = input(f"Είστε σίγουρος/η ότι θέλετε να αφαιρέσετε το προϊόν '{menu[order[table][item_choice][0]][0]}' με ποσότητα {order[table][item_choice][1]} από την παραγγελία; (y/n): ")
                        if confirm.lower() == "y":
                            removed_item = order[table].pop(item_choice)
                            print(f"\nΤο προϊόν '{menu[removed_item[0]][0]}' με ποσότητα {removed_item[1]} αφαιρέθηκε από την παραγγελία.\n")
                            break
                        elif confirm.lower() == "n":
                            print("Το προϊόν δεν αφαιρέθηκε από την παραγγελία.\n")
                            break
                    else:
                        print("Εισάγετε έναν έγκυρο αριθμό προϊόντος.")
                except ValueError:
                    print("Εισάγετε έναν έγκυρο αριθμό προϊόντος.")
        else:
            print("\nΗ παραγγελία είναι άδεια.\n")
    #Αν ο χρήστης επιλέξει "4", δίνεται η δυνατότητα στον χρήστη να πληρώσει την παραγγελία του τραπεζιού που έχει επιλεχθεί.
    #Πρώτα υπολογίζει το συνολικό ποσό της παραγγελίας με βάση τις τιμές των προϊόντων στο μενού και την ποσότητα τους. 
    #Στη συνέχεια, ρωτά τον χρήστη πώς θέλει να πληρώσει (με μετρητά ή με κάρτα) και ελέγχει αν η απάντηση είναι έγκυρη. 
    #Αν επιλεγεί η πληρωμή με μετρητά, ζητά το ποσό που πληρώνει ο χρήστης και ελέγχει αν είναι ίσο ή μεγαλύτερο από το συνολικό ποσό της παραγγελίας. 
    #Αν είναι, εκτυπώνει τα ρέστα και επιβεβαιώνει την αγορά. 
    #Αν η πληρωμή γίνεται με κάρτα, ζητά από τον χρήστη να επιβεβαιώσει την αγορά του και ανάλογα με την απάντηση, επιβεβαιώνει ή ακυρώνει την αγορά.
    #Αν η παραγγελία είναι άδεια, τότε εμφανίζεται στο χρήστη το αντίστοιχο μήνυμα.
    elif choice == "4":
        if order[table]:
            totablel = sum([menu[item[0]][2] * item[1] for item in order[table]])
            print(f"\nΗ συνολική αξία της παραγγελίας είναι: {totablel:.2f}€")
            checkpay=0
            while checkpay==0:
             print("Θέλετε να πληρώσετε με μετρητά ή κάρτα (1 για μετρητά / 2 για κάρτα)")
             pay_choice=int(input())
             if pay_choice != 1 and pay_choice != 2:
                 checkpay = 0
                 print("Εισάγετε (1 ή 2).")
             elif pay_choice == 1 or pay_choice == 2:
                 checkpay=1
            if pay_choice==1:
             while True:
                try:
                    amount = float(input("Εισάγετε το ποσό που δώθηκε: "))
                    if amount >= totablel:
                        print(f"\nΤα ρέστα είναι: {amount-totablel:.2f}€")
                        print("Η πληρωμή πραγματοποιήθηκε με επιτυχία!")
                        order[table].clear()
                        break
                    else:
                        print("Εισάγετε ένα ποσό μεγαλύτερο ή ίσο με το συνολικό ποσό της παραγγελίας.")
                except ValueError:
                    print("Εισάγετε ένα έγκυρο ποσό.")
            else:
                card=0
                while card==0: 
                   print("Επιβεβαιώστε αγορά με κάρτα (y/n)")
                   paycheck=input()
                   if paycheck=="y":
                    print("Η πληρωμή πραγματοποιήθηκε με επιτυχία!")
                    order[table].clear()
                    card=1
                   elif paycheck=="n":
                    print("Η πληρωμή δεν ολοκληρώθηκε.Παρακαλώ επαναλάβετε την διαδικασία πληρωμής.")
                    card=1
                   else:
                      print("Εισάγετε (y/n).")
                      card=0
        else:
            print("\nΗ παραγγελία είναι άδεια.\n")
